# Limpieza de datos

## Instalacion de Librerias para manipular Datos
## Primero Instalamos la libreria Pandas

In [416]:
pip install pandas

Requirement already satisfied: pandas in c:\users\mapko\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mapko\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2.8.2)
Requirement already satisfied: tzdata>=2022.1 in c:\users\mapko\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2023.3)
Requirement already satisfied: pytz>=2020.1 in c:\users\mapko\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\mapko\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (1.25.1)
Requirement already satisfied: six>=1.5 in c:\users\mapko\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.0.1 -> 23.1.2
[notice] To update, run: C:\Users\mapko\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

## Despues de Instalar Pandas
## Mandamos llamar Pandas con la siguiente Instrucción

In [417]:
import pandas as pd

### Mi Base de Datos llamada data

### Aquí creamos nuestra Base de Datos con el nombre "data"

In [418]:
data = {
    'Nombre': ['Juan','María','Pedro','An-a','Luis','María', 'Pe+dro','Tony','Luis','María','Marco','Ana','Agueda','Brenda','Mario'],
    'Edad': [25, 32, None, 42, 28, None, 32, 18, 28, 32, 57,42,57,None,60],
    'Fecha': ['31/01/2020','31/01/2020',None,'31-01-2020','01/31/2020',None,'31/01/2020','14-06-2015','01/31/2020','31/01/2020',None,'31/01/2020','15//2020',None,'15/03/1957'],
    'Género': ['M','F',None,'F','M',None,'F',None,'M','F','M','F','M','M','M'],
    'Ciudad': ['Madrid',None,'Madrid','Valencia','Baracelona','Madrid',None,'México','Baracelona',None,None,'Valeencia',None,None,'Perú'],
    'Altura': [175,163,180,158,170,180,163,168,170,163,179,158,190,155,170],
    'Peso': [70,None,80,60,75,80,None,None,75,None,None,60,55,00,80],
    'Ingresos': [50000,60000,40000,None,55000,40000,60000,75000,55000,60000,None,None,None,None,150000]
}

### Ahora vamos a crear nuestro DataFrame con nuestra Base de Datos llama "data"

In [419]:
df = pd.DataFrame(data)

print(df)

    Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0     Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
1    María  32.0  31/01/2020      F        None     163   NaN   60000.0
2    Pedro   NaN        None   None      Madrid     180  80.0   40000.0
3     An-a  42.0  31-01-2020      F    Valencia     158  60.0       NaN
4     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
5    María   NaN        None   None      Madrid     180  80.0   40000.0
6   Pe+dro  32.0  31/01/2020      F        None     163   NaN   60000.0
7     Tony  18.0  14-06-2015   None      México     168   NaN   75000.0
8     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
9    María  32.0  31/01/2020      F        None     163   NaN   60000.0
10   Marco  57.0        None      M        None     179   NaN       NaN
11     Ana  42.0  31/01/2020      F   Valeencia     158  60.0       NaN
12  Agueda  57.0    15//2020      M        None     190  55.0       NaN
13  Brenda   NaN        None      M        None     155   0.0       NaN
14   Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

### Ahora vamos mostrar nuestro DataFrame

In [420]:
df

    Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0     Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
1    María  32.0  31/01/2020      F        None     163   NaN   60000.0
2    Pedro   NaN        None   None      Madrid     180  80.0   40000.0
3     An-a  42.0  31-01-2020      F    Valencia     158  60.0       NaN
4     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
5    María   NaN        None   None      Madrid     180  80.0   40000.0
6   Pe+dro  32.0  31/01/2020      F        None     163   NaN   60000.0
7     Tony  18.0  14-06-2015   None      México     168   NaN   75000.0
8     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
9    María  32.0  31/01/2020      F        None     163   NaN   60000.0
10   Marco  57.0        None      M        None     179   NaN       NaN
11     Ana  42.0  31/01/2020      F   Valeencia     158  60.0       NaN
12  Agueda  57.0    15//2020      M        None     190  55.0       NaN
13  Brenda   NaN        None      M        None     155   0.0       NaN
14   Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

### Ahora vamos mostrar nuestro primeros 5 regsitros de nuestro DataFrame

In [421]:
df.head()

  Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0   Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
1  María  32.0  31/01/2020      F        None     163   NaN   60000.0
2  Pedro   NaN        None   None      Madrid     180  80.0   40000.0
3   An-a  42.0  31-01-2020      F    Valencia     158  60.0       NaN
4   Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0

### Ahora vamos mostrar nuestro ultimos 5 regsitros de nuestro DataFrame

In [422]:
df.tail()

    Nombre  Edad       Fecha Género     Ciudad  Altura  Peso  Ingresos
10   Marco  57.0        None      M       None     179   NaN       NaN
11     Ana  42.0  31/01/2020      F  Valeencia     158  60.0       NaN
12  Agueda  57.0    15//2020      M       None     190  55.0       NaN
13  Brenda   NaN        None      M       None     155   0.0       NaN
14   Mario  60.0  15/03/1957      M       Perú     170  80.0  150000.0

### Ahora vamos mostrar la Información de DataFrame

In [423]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    15 non-null     object
 1   Edad      12 non-null     float64
 2   Fecha     11 non-null     object
 3   Género    12 non-null     object
 4   Ciudad    9 non-null      object
 5   Altura    15 non-null     int64
 6   Peso      10 non-null     float64
 7   Ingresos  10 non-null     float64
dtypes: float64(3), int64(1), object(4)
memory usage: 1.1+ KB

### Ahora vamos desplegar los registros que tienen sus datos completos en nuestro DataFrame
### Creamos un nuevo DataFrame llamado df_sin_vacios y lo desplegamos para verificar los registros completos.
### Primero desplegamos nuestro DataFrame

In [424]:
df

    Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0     Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
1    María  32.0  31/01/2020      F        None     163   NaN   60000.0
2    Pedro   NaN        None   None      Madrid     180  80.0   40000.0
3     An-a  42.0  31-01-2020      F    Valencia     158  60.0       NaN
4     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
5    María   NaN        None   None      Madrid     180  80.0   40000.0
6   Pe+dro  32.0  31/01/2020      F        None     163   NaN   60000.0
7     Tony  18.0  14-06-2015   None      México     168   NaN   75000.0
8     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
9    María  32.0  31/01/2020      F        None     163   NaN   60000.0
10   Marco  57.0        None      M        None     179   NaN       NaN
11     Ana  42.0  31/01/2020      F   Valeencia     158  60.0       NaN
12  Agueda  57.0    15//2020      M        None     190  55.0       NaN
13  Brenda   NaN        None      M        None     155   0.0       NaN
14   Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

### Desplegamos los registros que estan completos en nuestro DataFrame
### Crearemos un nuevo DatFrame con el nombre de df_sin_vacios

In [425]:
df_sin_vacios = df.dropna()

print(df_sin_vacios.to_string())

   Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0    Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
4    Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
8    Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
14  Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

### Desplegamos los registros que estan completos o que no están vacios en nuestro DataFrame

In [426]:
df.dropna(inplace= True)

print(df.to_string())

   Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0    Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
4    Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
8    Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
14  Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

### Desplegamos nuevamente nuestro DataFrame

In [427]:
df = pd.DataFrame(data)

print(df)

    Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0     Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
1    María  32.0  31/01/2020      F        None     163   NaN   60000.0
2    Pedro   NaN        None   None      Madrid     180  80.0   40000.0
3     An-a  42.0  31-01-2020      F    Valencia     158  60.0       NaN
4     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
5    María   NaN        None   None      Madrid     180  80.0   40000.0
6   Pe+dro  32.0  31/01/2020      F        None     163   NaN   60000.0
7     Tony  18.0  14-06-2015   None      México     168   NaN   75000.0
8     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
9    María  32.0  31/01/2020      F        None     163   NaN   60000.0
10   Marco  57.0        None      M        None     179   NaN       NaN
11     Ana  42.0  31/01/2020      F   Valeencia     158  60.0       NaN
12  Agueda  57.0    15//2020      M        None     190  55.0       NaN
13  Brenda   NaN        None      M        None     155   0.0       NaN
14   Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

### Despues de verificar los registros con lugares vacios en nuestro DataFrame
### Vamos a COMPLETAR esos lugares sin datos con la etiqueta Sin_Dato en nuestro DataFrame
### Creamos un nuevo DataFrame llamado df_completar y lo desplegamos.

In [428]:
df_completar = df.fillna("Sin_Dato")

print(df_completar.to_string())

    Nombre      Edad       Fecha    Género      Ciudad  Altura      Peso  Ingresos
0     Juan      25.0  31/01/2020         M      Madrid     175      70.0   50000.0
1    María      32.0  31/01/2020         F    Sin_Dato     163  Sin_Dato   60000.0
2    Pedro  Sin_Dato    Sin_Dato  Sin_Dato      Madrid     180      80.0   40000.0
3     An-a      42.0  31-01-2020         F    Valencia     158      60.0  Sin_Dato
4     Luis      28.0  01/31/2020         M  Baracelona     170      75.0   55000.0
5    María  Sin_Dato    Sin_Dato  Sin_Dato      Madrid     180      80.0   40000.0
6   Pe+dro      32.0  31/01/2020         F    Sin_Dato     163  Sin_Dato   60000.0
7     Tony      18.0  14-06-2015  Sin_Dato      México     168  Sin_Dato   75000.0
8     Luis      28.0  01/31/2020         M  Baracelona     170      75.0   55000.0
9    María      32.0  31/01/2020         F    Sin_Dato     163  Sin_Dato   60000.0
10   Marco      57.0    Sin_Dato         M    Sin_Dato     179  Sin_Dato  Sin_Dato
11     Ana      42.0  31/01/2020         F   Valeencia     158      60.0  Sin_Dato
12  Agueda      57.0    15//2020         M    Sin_Dato     190      55.0  Sin_Dato
13  Brenda  Sin_Dato    Sin_Dato         M    Sin_Dato     155       0.0  Sin_Dato
14   Mario      60.0  15/03/1957         M        Perú     170      80.0  150000.0

### Creamos un nuevo DataFrame con la columna Ingresos para modificarla
### Vamos a rellenar con un cero (0) el campo que no tenga dato numerico

In [429]:
df_con_un_cero = df["Ingresos"].fillna(0)

print(df_con_un_cero)

0      50000.0
1      60000.0
2      40000.0
3          0.0
4      55000.0
5      40000.0
6      60000.0
7      75000.0
8      55000.0
9      60000.0
10         0.0
11         0.0
12         0.0
13         0.0
14    150000.0
Name: Ingresos, dtype: float64

### Desplegarermos nuestra DataFrame

In [430]:
df

    Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0     Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
1    María  32.0  31/01/2020      F        None     163   NaN   60000.0
2    Pedro   NaN        None   None      Madrid     180  80.0   40000.0
3     An-a  42.0  31-01-2020      F    Valencia     158  60.0       NaN
4     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
5    María   NaN        None   None      Madrid     180  80.0   40000.0
6   Pe+dro  32.0  31/01/2020      F        None     163   NaN   60000.0
7     Tony  18.0  14-06-2015   None      México     168   NaN   75000.0
8     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
9    María  32.0  31/01/2020      F        None     163   NaN   60000.0
10   Marco  57.0        None      M        None     179   NaN       NaN
11     Ana  42.0  31/01/2020      F   Valeencia     158  60.0       NaN
12  Agueda  57.0    15//2020      M        None     190  55.0       NaN
13  Brenda   NaN        None      M        None     155   0.0       NaN
14   Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

### Ahora vamos a realizar un cálculo estadístico en nuestro DataFrame
### Vamos a sacar estadisticamente la media, moda y la mediana en nuestras columnas

### Primero empezaremos por la media nuestra columna Ingresos

In [431]:
nuestra_media = df["Ingresos"].mean()

print(nuestra_media)

64500.0

### Ahora vamos a rellenar con esta (media) llamada (nuestra_media)
### en la columna Ingresos los lugares que no tengan dato numerico
### Y la desplegamos para ver la modificación.

In [432]:
df["Ingresos"].fillna(nuestra_media, inplace=True)

print(df)

    Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0     Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
1    María  32.0  31/01/2020      F        None     163   NaN   60000.0
2    Pedro   NaN        None   None      Madrid     180  80.0   40000.0
3     An-a  42.0  31-01-2020      F    Valencia     158  60.0   64500.0
4     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
5    María   NaN        None   None      Madrid     180  80.0   40000.0
6   Pe+dro  32.0  31/01/2020      F        None     163   NaN   60000.0
7     Tony  18.0  14-06-2015   None      México     168   NaN   75000.0
8     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
9    María  32.0  31/01/2020      F        None     163   NaN   60000.0
10   Marco  57.0        None      M        None     179   NaN   64500.0
11     Ana  42.0  31/01/2020      F   Valeencia     158  60.0   64500.0
12  Agueda  57.0    15//2020      M        None     190  55.0   64500.0
13  Brenda   NaN        None      M        None     155   0.0   64500.0
14   Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

### Segundo vamos a sacar la moda en nuestra columna Ciudad de nuestro DataFrame
### para despues reemplazar los campos que no tienen dato en nuestra DataFrame

In [433]:
nuestra_moda = df["Ciudad"].mode()

print(nuestra_moda)

0    Madrid
Name: Ciudad, dtype: object

### Ahora vamos a rellenar con esta (moda) llamada (nuestra_moda)
### en la columna Ciudad los lugares que no tengan dato de la ciudad
### con la instrución loc
### Y la desplegamos para ver la modificación.

In [434]:
print(df)

    Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0     Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
1    María  32.0  31/01/2020      F        None     163   NaN   60000.0
2    Pedro   NaN        None   None      Madrid     180  80.0   40000.0
3     An-a  42.0  31-01-2020      F    Valencia     158  60.0   64500.0
4     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
5    María   NaN        None   None      Madrid     180  80.0   40000.0
6   Pe+dro  32.0  31/01/2020      F        None     163   NaN   60000.0
7     Tony  18.0  14-06-2015   None      México     168   NaN   75000.0
8     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
9    María  32.0  31/01/2020      F        None     163   NaN   60000.0
10   Marco  57.0        None      M        None     179   NaN   64500.0
11     Ana  42.0  31/01/2020      F   Valeencia     158  60.0   64500.0
12  Agueda  57.0    15//2020      M        None     190  55.0   64500.0
13  Brenda   NaN        None      M        None     155   0.0   64500.0
14   Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

### Y la desplegamos para ver la modificación.

In [435]:
df.loc[1,"Ciudad"] = "Madrid"
df.loc[6,"Ciudad"] = "Madrid"
df.loc[9,"Ciudad"] = "Madrid"
df.loc[10,"Ciudad"] = "Madrid"
df.loc[12,"Ciudad"] = "Madrid"
df.loc[13,"Ciudad"] = "Madrid"

print(df)

    Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0     Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
1    María  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
2    Pedro   NaN        None   None      Madrid     180  80.0   40000.0
3     An-a  42.0  31-01-2020      F    Valencia     158  60.0   64500.0
4     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
5    María   NaN        None   None      Madrid     180  80.0   40000.0
6   Pe+dro  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
7     Tony  18.0  14-06-2015   None      México     168   NaN   75000.0
8     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
9    María  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
10   Marco  57.0        None      M      Madrid     179   NaN   64500.0
11     Ana  42.0  31/01/2020      F   Valeencia     158  60.0   64500.0
12  Agueda  57.0    15//2020      M      Madrid     190  55.0   64500.0
13  Brenda   NaN        None      M      Madrid     155   0.0   64500.0
14   Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

### Con la misma instrucción loc vamos a corregir
### los nombres mal escritos en la columna Nombre (An-a y Pe+dro)
### Y lo vamos a desplegar

In [436]:
df.loc[3,"Nombre"] = "Ana"
df.loc[6,"Nombre"] = "Pedro"


print(df)

    Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0     Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
1    María  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
2    Pedro   NaN        None   None      Madrid     180  80.0   40000.0
3      Ana  42.0  31-01-2020      F    Valencia     158  60.0   64500.0
4     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
5    María   NaN        None   None      Madrid     180  80.0   40000.0
6    Pedro  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
7     Tony  18.0  14-06-2015   None      México     168   NaN   75000.0
8     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
9    María  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
10   Marco  57.0        None      M      Madrid     179   NaN   64500.0
11     Ana  42.0  31/01/2020      F   Valeencia     158  60.0   64500.0
12  Agueda  57.0    15//2020      M      Madrid     190  55.0   64500.0
13  Brenda   NaN        None      M      Madrid     155   0.0   64500.0
14   Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

### Con la misma instrucción loc vamos a competar las fechas
### faltantes y corregir las fechas mal escritas en la columna Fecha
### Y lo vamos a desplegar

In [437]:
print(df)

    Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0     Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
1    María  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
2    Pedro   NaN        None   None      Madrid     180  80.0   40000.0
3      Ana  42.0  31-01-2020      F    Valencia     158  60.0   64500.0
4     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
5    María   NaN        None   None      Madrid     180  80.0   40000.0
6    Pedro  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
7     Tony  18.0  14-06-2015   None      México     168   NaN   75000.0
8     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
9    María  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
10   Marco  57.0        None      M      Madrid     179   NaN   64500.0
11     Ana  42.0  31/01/2020      F   Valeencia     158  60.0   64500.0
12  Agueda  57.0    15//2020      M      Madrid     190  55.0   64500.0
13  Brenda   NaN        None      M      Madrid     155   0.0   64500.0
14   Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

In [438]:
df.loc[2,"Fecha"] = "28/03/1970"
df.loc[3,"Fecha"] = "31/01/2020"
df.loc[5,"Fecha"] = "14/11/2000"
df.loc[7,"Fecha"] = "14/06/2015"
df.loc[10,"Fecha"] = "19/07/2008"
df.loc[12,"Fecha"] = "15/04/2020"
df.loc[13,"Fecha"] = "26/11/1990"


print(df)

    Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0     Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
1    María  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
2    Pedro   NaN  28/03/1970   None      Madrid     180  80.0   40000.0
3      Ana  42.0  31/01/2020      F    Valencia     158  60.0   64500.0
4     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
5    María   NaN  14/11/2000   None      Madrid     180  80.0   40000.0
6    Pedro  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
7     Tony  18.0  14/06/2015   None      México     168   NaN   75000.0
8     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
9    María  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
10   Marco  57.0  19/07/2008      M      Madrid     179   NaN   64500.0
11     Ana  42.0  31/01/2020      F   Valeencia     158  60.0   64500.0
12  Agueda  57.0  15/04/2020      M      Madrid     190  55.0   64500.0
13  Brenda   NaN  26/11/1990      M      Madrid     155   0.0   64500.0
14   Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

### Con la misma instrucción loc vamos a competar las edades en la columna Edad
### Y lo vamos a desplegar

In [439]:
df.loc[2,"Edad"] = 26
df.loc[5,"Edad"] = 44
df.loc[13,"Edad"] = 55

print(df)

    Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0     Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
1    María  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
2    Pedro  26.0  28/03/1970   None      Madrid     180  80.0   40000.0
3      Ana  42.0  31/01/2020      F    Valencia     158  60.0   64500.0
4     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
5    María  44.0  14/11/2000   None      Madrid     180  80.0   40000.0
6    Pedro  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
7     Tony  18.0  14/06/2015   None      México     168   NaN   75000.0
8     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
9    María  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
10   Marco  57.0  19/07/2008      M      Madrid     179   NaN   64500.0
11     Ana  42.0  31/01/2020      F   Valeencia     158  60.0   64500.0
12  Agueda  57.0  15/04/2020      M      Madrid     190  55.0   64500.0
13  Brenda  55.0  26/11/1990      M      Madrid     155   0.0   64500.0
14   Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

### Con la misma instrucción loc vamos a competar el sexos en la columna Género
### Por que algunos le faltan y otros estas incorrrectos
### Y lo vamos a desplegar

In [440]:
df.loc[2,"Género"] = "M"
df.loc[5,"Género"] = "F"
df.loc[6,"Género"] = "M"
df.loc[7,"Género"] = "M"
df.loc[12,"Género"] = "F"
df.loc[13,"Género"] = "F"


print(df)

    Nombre  Edad       Fecha Género      Ciudad  Altura  Peso  Ingresos
0     Juan  25.0  31/01/2020      M      Madrid     175  70.0   50000.0
1    María  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
2    Pedro  26.0  28/03/1970      M      Madrid     180  80.0   40000.0
3      Ana  42.0  31/01/2020      F    Valencia     158  60.0   64500.0
4     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
5    María  44.0  14/11/2000      F      Madrid     180  80.0   40000.0
6    Pedro  32.0  31/01/2020      M      Madrid     163   NaN   60000.0
7     Tony  18.0  14/06/2015      M      México     168   NaN   75000.0
8     Luis  28.0  01/31/2020      M  Baracelona     170  75.0   55000.0
9    María  32.0  31/01/2020      F      Madrid     163   NaN   60000.0
10   Marco  57.0  19/07/2008      M      Madrid     179   NaN   64500.0
11     Ana  42.0  31/01/2020      F   Valeencia     158  60.0   64500.0
12  Agueda  57.0  15/04/2020      F      Madrid     190  55.0   64500.0
13  Brenda  55.0  26/11/1990      F      Madrid     155   0.0   64500.0
14   Mario  60.0  15/03/1957      M        Perú     170  80.0  150000.0

### Con la misma instrucción loc vamos a competar el peso en la columna Peso
### Por que algunos le faltan
### Y lo vamos a desplegar

In [441]:
df.loc[1,"Peso"] = 55
df.loc[6,"Peso"] = 100
df.loc[7,"Peso"] = 120
df.loc[9,"Peso"] = 75
df.loc[10,"Peso"] = 80
df.loc[13,"Peso"] = 66

print(df)

    Nombre  Edad       Fecha Género      Ciudad  Altura   Peso  Ingresos
0     Juan  25.0  31/01/2020      M      Madrid     175   70.0   50000.0
1    María  32.0  31/01/2020      F      Madrid     163   55.0   60000.0
2    Pedro  26.0  28/03/1970      M      Madrid     180   80.0   40000.0
3      Ana  42.0  31/01/2020      F    Valencia     158   60.0   64500.0
4     Luis  28.0  01/31/2020      M  Baracelona     170   75.0   55000.0
5    María  44.0  14/11/2000      F      Madrid     180   80.0   40000.0
6    Pedro  32.0  31/01/2020      M      Madrid     163  100.0   60000.0
7     Tony  18.0  14/06/2015      M      México     168  120.0   75000.0
8     Luis  28.0  01/31/2020      M  Baracelona     170   75.0   55000.0
9    María  32.0  31/01/2020      F      Madrid     163   75.0   60000.0
10   Marco  57.0  19/07/2008      M      Madrid     179   80.0   64500.0
11     Ana  42.0  31/01/2020      F   Valeencia     158   60.0   64500.0
12  Agueda  57.0  15/04/2020      F      Madrid     190   55.0   64500.0
13  Brenda  55.0  26/11/1990      F      Madrid     155   66.0   64500.0
14   Mario  60.0  15/03/1957      M        Perú     170   80.0  150000.0

In [442]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    15 non-null     object
 1   Edad      15 non-null     float64
 2   Fecha     15 non-null     object
 3   Género    15 non-null     object
 4   Ciudad    15 non-null     object
 5   Altura    15 non-null     int64
 6   Peso      15 non-null     float64
 7   Ingresos  15 non-null     float64
dtypes: float64(3), int64(1), object(4)
memory usage: 1.1+ KB